Revit 2026 API

# ExternalServiceResult Enumeration

---

An enumerated value representing a result from executing an external service.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExternalServiceResult
```
```vb
Public Enumeration ExternalServiceResult
```
```cpp
public enum class ExternalServiceResult
```
```fsharp
type ExternalServiceResult
```

| Member name | Value | Description |
| --- | --- | --- |
| Failed | 1 | Service execution has failed. |
| Succeeded | 0 | Service has been executed successfully. |
| Unhandled | 2 | Execution of a service has not been handled; possibly because there are no applicable servers. |

#### Reference

Autodesk.Revit.DB.ExternalService Namespace